OpenFOAM-2112/stirring-multiSolidBodyMotionSolver/constant/innerCircle6DOF.txt
2001
(
(	0	(	(	0	0	0	)	(	0	0	0	)	)	)
(	0.001	(	(	0.000223738	0	1.13571E-05	)	(	0	0	0	)	)	)
(	0.002	(	(	0.000447601	0	1.99018E-05	)	(	0	0	0	)	)	)
(	0.003	(	(	0.000671553	0	2.56329E-05	)	(	0	0	0	)	)	)
(	0.004	(	(	0.00089556	0	2.85494E-05	)	(	0	0	0	)	)	)
(	0.005	(	(	0.001119586	0	2.86509E-05	)	(	0	0	0	)	)	)
(	0.006	(	(	0.001343596	0	2.59373E-05	)	(	0	0	0	)	)	)
(	0.007	(	(	0.001567553	0	2.04091E-05	)	(	0	0	0	)	)	)
(	0.008	(	(	0.001791424	0	1.20672E-05	)	(	0	0	0	)	)	)
(	0.009	(	(	0.002015172	0	9.12873E-07	)	(	0	0	0	)	)	)
(	0.01	(	(	0.002238762	0	-1.30521E-05	)	(	0	0	0	)	)	)
(	0.011	(	(	0.002462159	0	-2.98256E-05	)	(	0	0	0	)	)	)
(	0.012	(	(	0.002685328	0	-4.94049E-05	)	(	0	0	0	)	)	)
(	0.013	(	(	0.002908233	0	-7.17869E-05	)	(	0	0	0	)	)	)
(	0.014	(	(	0.003130839	0	-9.6968E-05	)	(	0	0	0	)	)	)
(	0.015	(	(	0.003353111	0	-0.000124944	)	(	0	0	0	)	)	)
(	0.016	(	(	0.003575014	0	-0.000155712	)	(	0	0	0	)	)	)
(	0.017	(	(	0.003796513	0	-0.000189265	)	(	0	0	0	)	)	)
(	0.018	(	(	0.004017573	0	-0.000225598	)	(	0	0	0	)	)	)
(	0.019	(	(	0.004238159	0	-0.000264707	)	(	0	0	0	)	)	)
(	0.02	(	(	0.004458236	0	-0.000306584	)	(	0	0	0	)	)	)
(	0.021	(	(	0.004677769	0	-0.000351224	)	(	0	0	0	)	)	)
(	0.022	(	(	0.004896725	0	-0.000398618	)	(	0	0	0	)	)	)
(	0.023	(	(	0.005115067	0	-0.00044876	)	(	0	0	0	)	)	)
(	0.024	(	(	0.005332762	0	-0.000501642	)	(	0	0	0	)	)	)
(	0.025	(	(	0.005549775	0	-0.000557255	)	(	0	0	0	)	)	)
(	0.026	(	(	0.005766073	0	-0.000615591	)	(	0	0	0	)	)	)
(	0.027	(	(	0.00598162	0	-0.00067664	)	(	0	0	0	)	)	)
(	0.028	(	(	0.006196383	0	-0.000740392	)	(	0	0	0	)	)	)
(	0.029	(	(	0.006410328	0	-0.000806839	)	(	0	0	0	)	)	)
(	0.03	(	(	0.006623421	0	-0.000875968	)	(	0	0	0	)	)	)
(	0.031	(	(	0.006835629	0	-0.000947769	)	(	0	0	0	)	)	)
(	0.032	(	(	0.007046918	0	-0.001022232	)	(	0	0	0	)	)	)
(	0.033	(	(	0.007257255	0	-0.001099343	)	(	0	0	0	)	)	)
(	0.034	(	(	0.007466605	0	-0.001179092	)	(	0	0	0	)	)	)
(	0.035	(	(	0.007674938	0	-0.001261464	)	(	0	0	0	)	)	)
(	0.036	(	(	0.007882218	0	-0.001346449	)	(	0	0	0	)	)	)
(	0.037	(	(	0.008088415	0	-0.001434031	)	(	0	0	0	)	)	)
(	0.038	(	(	0.008293495	0	-0.001524197	)	(	0	0	0	)	)	)
(	0.039	(	(	0.008497425	0	-0.001616933	)	(	0	0	0	)	)	)
(	0.04	(	(	0.008700174	0	-0.001712224	)	(	0	0	0	)	)	)
(	0.041	(	(	0.00890171	0	-0.001810055	)	(	0	0	0	)	)	)
(	0.042	(	(	0.009102	0	-0.001910411	)	(	0	0	0	)	)	)
(	0.043	(	(	0.009301014	0	-0.002013276	)	(	0	0	0	)	)	)
(	0.044	(	(	0.009498719	0	-0.002118633	)	(	0	0	0	)	)	)
(	0.045	(	(	0.009695085	0	-0.002226467	)	(	0	0	0	)	)	)
(	0.046	(	(	0.009890081	0	-0.002336759	)	(	0	0	0	)	)	)
(	0.047	(	(	0.010083675	0	-0.002449493	)	(	0	0	0	)	)	)
(	0.048	(	(	0.010275837	0	-0.002564651	)	(	0	0	0	)	)	)
(	0.049	(	(	0.010466537	0	-0.002682214	)	(	0	0	0	)	)	)
(	0.05	(	(	0.010655745	0	-0.002802164	)	(	0	0	0	)	)	)
(	0.051	(	(	0.01084343	0	-0.002924482	)	(	0	0	0	)	)	)
(	0.052	(	(	0.011029564	0	-0.003049149	)	(	0	0	0	)	)	)
(	0.053	(	(	0.011214116	0	-0.003176146	)	(	0	0	0	)	)	)
(	0.054	(	(	0.011397058	0	-0.003305451	)	(	0	0	0	)	)	)
(	0.055	(	(	0.011578361	0	-0.003437044	)	(	0	0	0	)	)	)
(	0.056	(	(	0.011757996	0	-0.003570906	)	(	0	0	0	)	)	)
(	0.057	(	(	0.011935935	0	-0.003707014	)	(	0	0	0	)	)	)
(	0.058	(	(	0.012112149	0	-0.003845347	)	(	0	0	0	)	)	)
(	0.059	(	(	0.012286611	0	-0.003985884	)	(	0	0	0	)	)	)
(	0.06	(	(	0.012459294	0	-0.004128601	)	(	0	0	0	)	)	)
(	0.061	(	(	0.012630169	0	-0.004273478	)	(	0	0	0	)	)	)
(	0.062	(	(	0.012799211	0	-0.00442049	)	(	0	0	0	)	)	)
(	0.063	(	(	0.012966392	0	-0.004569614	)	(	0	0	0	)	)	)
(	0.064	(	(	0.013131686	0	-0.004720828	)	(	0	0	0	)	)	)
(	0.065	(	(	0.013295066	0	-0.004874107	)	(	0	0	0	)	)	)
(	0.066	(	(	0.013456508	0	-0.005029426	)	(	0	0	0	)	)	)
(	0.067	(	(	0.013615986	0	-0.005186762	)	(	0	0	0	)	)	)
(	0.068	(	(	0.013773473	0	-0.00534609	)	(	0	0	0	)	)	)
(	0.069	(	(	0.013928946	0	-0.005507383	)	(	0	0	0	)	)	)
(	0.07	(	(	0.014082381	0	-0.005670618	)	(	0	0	0	)	)	)
(	0.071	(	(	0.014233752	0	-0.005835768	)	(	0	0	0	)	)	)
(	0.072	(	(	0.014383035	0	-0.006002807	)	(	0	0	0	)	)	)
(	0.073	(	(	0.014530208	0	-0.006171708	)	(	0	0	0	)	)	)
(	0.074	(	(	0.014675247	0	-0.006342446	)	(	0	0	0	)	)	)
(	0.075	(	(	0.014818129	0	-0.006514992	)	(	0	0	0	)	)	)
(	0.076	(	(	0.014958832	0	-0.00668932	)	(	0	0	0	)	)	)
(	0.077	(	(	0.015097333	0	-0.006865403	)	(	0	0	0	)	)	)
(	0.078	(	(	0.015233611	0	-0.007043212	)	(	0	0	0	)	)	)
(	0.079	(	(	0.015367643	0	-0.007222719	)	(	0	0	0	)	)	)
(	0.08	(	(	0.015499409	0	-0.007403897	)	(	0	0	0	)	)	)
(	0.081	(	(	0.015628889	0	-0.007586716	)	(	0	0	0	)	)	)
(	0.082	(	(	0.01575606	0	-0.007771147	)	(	0	0	0	)	)	)
(	0.083	(	(	0.015880905	0	-0.007957162	)	(	0	0	0	)	)	)
(	0.084	(	(	0.016003402	0	-0.008144731	)	(	0	0	0	)	)	)
(	0.085	(	(	0.016123532	0	-0.008333824	)	(	0	0	0	)	)	)
(	0.086	(	(	0.016241277	0	-0.008524412	)	(	0	0	0	)	)	)
(	0.087	(	(	0.016356617	0	-0.008716465	)	(	0	0	0	)	)	)
(	0.088	(	(	0.016469536	0	-0.008909951	)	(	0	0	0	)	)	)
(	0.089	(	(	0.016580014	0	-0.009104841	)	(	0	0	0	)	)	)
(	0.09	(	(	0.016688034	0	-0.009301105	)	(	0	0	0	)	)	)
(	0.091	(	(	0.01679358	0	-0.009498709	)	(	0	0	0	)	)	)
(	0.092	(	(	0.016896634	0	-0.009697625	)	(	0	0	0	)	)	)
(	0.093	(	(	0.016997181	0	-0.00989782	)	(	0	0	0	)	)	)
(	0.094	(	(	0.017095204	0	-0.010099262	)	(	0	0	0	)	)	)
(	0.095	(	(	0.017190688	0	-0.010301921	)	(	0	0	0	)	)	)
(	0.096	(	(	0.017283618	0	-0.010505763	)	(	0	0	0	)	)	)
(	0.097	(	(	0.01737398	0	-0.010710756	)	(	0	0	0	)	)	)
...
)
